app/views/users/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = $1  [["user_id", 1]]
---
	<div class="row">
		<% @user.reviews.each do |review| %>