app/views/dishes/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."dish_id" = $1  [["dish_id", 1]]
---
	<div class="row">
		<% @dish.reviews.each do |review| %>