app/controllers/users_controller.rb

	def create
		@user = User.create(user_params)
---
INSERT INTO "users" ("first_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

	def show
		@user = User.find(params[:id]) #find user with that id and save as instance of user
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]